app/views/partes/index.html.erb

		<td><%= link_to "Eliminar", parte, :confirm => "Seguro desea eliminar este auto?", :method => :delete, class: "boton" %></td>
		<% auto = @autos.where(:id => parte.auto_id) %>
---
SELECT "autos".* FROM "autos" WHERE "autos"."id" = ?  [["id", 1]]