app/controllers/autos_controller.rb

  def index
  	@autos = Auto.all
---
SELECT "autos".* FROM "autos"

  def show
  	@auto = Auto.find(params[:id])
    @partes = Parte.all
---
SELECT  "autos".* FROM "autos" WHERE "autos"."id" = ? LIMIT 1  [["id", 1]]
SELECT "partes".* FROM "partes" WHERE "partes"."auto_id" = ?  [["auto_id", nil]]

  def create
  	@auto = Auto.new(marca: params[:auto][:marca],
  					 modelo: params[:auto][:modelo])
  	if @auto.save
---
INSERT INTO "autos" ("marca", "modelo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["marca", "Toyota"], ["modelo", "Yaris"], ["created_at", "2015-08-18 07:20:19.653454"], ["updated_at", "2015-08-18 07:20:19.653454"]]

  def edit
  	@auto = Auto.find(params[:id])
---
SELECT  "autos".* FROM "autos" WHERE "autos"."id" = ? LIMIT 1  [["id", 1]]

  def update
  	@auto = Auto.find(params[:id])
  	@auto.marca = params[:auto][:marca]
  	@auto.modelo = params[:auto][:modelo]

  	if @auto.save
---
SELECT  "autos".* FROM "autos" WHERE "autos"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "autos" SET "modelo" = ?, "updated_at" = ? WHERE "autos"."id" = ?  [["modelo", "A3"], ["updated_at", "2015-08-18 22:35:50.005776"], ["id", 5]]

  def destroy
  	@auto = Auto.find(params[:id]);
	if @auto.destroy()
---
SELECT  "autos".* FROM "autos" WHERE "autos"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "autos" WHERE "autos"."id" = ?  [["id", 5]]