app/controllers/partes_controller.rb

SELECT "partes".* FROM "partes"
SELECT "autos".* FROM "autos"
---
  def index
    @partes = Parte.all
    @autos = Auto.all

INSERT INTO "partes" ("nombre", "cantidad", "auto_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "Chasis Morning"], ["cantidad", 5], ["auto_id", 1], ["created_at", "2015-08-19 06:15:07.505005"], ["updated_at", "2015-08-19 06:15:07.505005"]]
---
  def create

    @parte = Parte.new(nombre: params[:parte][:nombre],
             cantidad: params[:parte][:cantidad],
             auto_id: params[:parte][:auto_id])
    if @parte.save

SELECT  "partes".* FROM "partes" WHERE "partes"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @parte = Parte.find(params[:id])

SELECT  "partes".* FROM "partes" WHERE "partes"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "partes" SET "cantidad" = ?, "updated_at" = ? WHERE "partes"."id" = ?  [["cantidad", 9], ["updated_at", "2015-08-19 07:11:02.369333"], ["id", 2]]
---
  def update
    @parte = Parte.find(params[:id])
    @parte.nombre = params[:parte][:nombre]
    @parte.cantidad = params[:parte][:cantidad]
    @parte.auto_id = params[:parte][:auto_id]

    if @parte.save